---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData
source: html/83417712-9a53-53da-62ca-2a8fed96c875.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData

The input and output data used by external servers for calculation of the pipe fitting and pipe accessory pressure drop.

## Syntax (C#)
```csharp
public class PipeFittingAndAccessoryPressureDropData : IDisposable
```